import React from "react";
import iconImg from "../../Profile/icon/documentImg.svg";
import "./document.css";

function DocumentPage() {
  return (
    <div className="support">
      <div className="support_search">
        <div className="support_search-path">
          <span>Служба поддержки G-fit</span> › Помощь и поддержка › Центр
          доступа
        </div>
        <input type="search" placeholder="Поиск" />
      </div>
      <div className="support_block">
        <div className="support_articles">
          <h1>Статьи в этом разделе</h1>
          <div className="support_list">
            <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
              Информация и настройки доступа
            </a>
            <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
              Редактирование предыдущих тренировок
            </a>
            <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
              Настройки конфиденциальности по умолчанию при создании аккаунта
              G-fit
            </a>
            <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
              Как скрыть статистику тренировки
            </a>
            <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
              Электронные сообщения от G-fit относительно безопасности аккаунта
            </a>
            <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
              Часто задаваемые вопросы по настройкам конфиденциальности G-fit
            </a>
            <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
              Как G-fit использует данные показателей здоровья
            </a>
            <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
              Удаление аккаунта G-fit
            </a>
            <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
              Экспорт данных и экспорт нескольких файлов
            </a>
            <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
              Можно ли использовать G-fit, если мне меньше 16 лет?
            </a>
          </div>
          <button className="support_list-btn">Больше</button>
        </div>
        <div className="support_box">
          <h1 className="support_inner-title">
            Настройки конфиденциальности для тренировок
          </h1>
          <div className="support_inner">
            <div className="support_inner-box">
              <img src={iconImg} alt="" />
              <div className="support_inner-name">
                <h3>Meg</h3>
                <p>Обновлено 19 сентябрь 2022 г. 20:05</p>
              </div>
            </div>
            <div className="support_inner-btn">
              <button>Подписаться</button>
            </div>
          </div>

          <div className="support_content">
            <ul className="support_content-item">
              <h1>
                Физические активности с настройками доступа «Подписчикам» или
                «Только вам» не появляются в турнирных таблицах и не участвуют в
                некоторых задачах.
              </h1>
              <li>
                Чтобы физическая активность участвовала в турнирных таблицах,
                настройки доступа должны быть установлены на опции «Всем». Более
                подробную информацию о том, как управлять настройками доступа,
                можно найти ниже.
              </li>
              <li>
                Вне зависимости от выбранных настроек для активности спортсмены
                всегда могут видеть собственное время участка на странице
                активности.
              </li>
              <li>
                Для некоторых задач требуется установить настройки доступа на
                опции «Всем». Обязательно ознакомьтесь с официальными правилами,
                размещенными на странице задачи. Подробнее о том, как управлять
                настройками доступа, смотрите ниже.
              </li>
            </ul>

            <ul className="support_content-item">
              <h3>Что такое страница с данными тренировок?</h3>
              <li>
                Страница с данными тренировок показывает полные данные по всей
                физической активности на сайте или в мобильном приложении.
                Данные включают дату и время, статистику, биометрические
                показатели, аналитические графики, карты, совпадения участков,
                достижения и время, профиль набора высоты и другие показатели.
              </li>
            </ul>

            <ul className="support_content-item">
              <h3>Где находятся настройки конфиденциальности?</h3>
              <ul className="support_content-text">
                <h5>Изменение настроек по умолчанию</h5>
                <li>
                  В левой части страницы нажать на «Настройки
                  конфиденциальности».
                </li>
                <li>
                  Выберите опцию «Всем», «Подписчикам» или «Только вам» в
                  разделе «Физическая активность».
                </li>

                <li className="italic">
                  Настройки конфиденциальности тренировок по умолчанию
                  гарантируют, что все будущие загрузки учитывают предпочтения
                  спортсмена. Данная настройка не изменяет настройки
                  конфиденциальности предыдущих активностей, загруженных ранее.
                </li>

                <li>
                  <span>На сайте</span> перейдите на{" "}
                  <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
                    страницу настроек
                  </a>
                  , наведя курсор на фото профиля в правом верхнем углу и выбрав
                  «Настройки».
                </li>

                <li>
                  <span>В мобильном приложении</span> следует открыть настройки
                  через значок шестеренки в правом верхнем углу страницы{" "}
                  <span>Главная</span>,<span>Группы</span> или <span>Вы</span>.
                  Затем выберите «Настройки конфиденциальности».
                </li>

                <h5>Изменение настроек для индивидуальных тренировок</h5>

                <li>
                  Настройки конфиденциальности отдельных тренировок также
                  находятся на странице загрузки в мобильной версии и на сайте.
                </li>

                <li>
                  <span>На сайте</span> перейдите к физической активности и
                  выберите «Редактировать» (символ карандаша). Выберите
                  «Настройки конфиденциальности», а затем одну из опций —
                  «Всем», «Только вам» или «Подписчикам».
                </li>

                <li>
                  <span>В мобильном приложении</span> перейдите к физической
                  активности и выберите «Редактировать». Коснитесь опции
                  «Настройки конфиденциальности», а затем одной из опций —
                  «Всем», «Только вам» или «Подписчикам».
                </li>
              </ul>
            </ul>

            <ul className="support_content-item">
              <h4>Какие настройки доступны участникам?</h4>
              <li>
                Настройки конфиденциальности тренировки позволяют предоставлять
                доступ к тренировочной информации всем, подписчикам или только
                пользователю. Возможно настроить опцию по умолчанию, тогда все
                тренировки автоматически будут загружаться с выбранными
                настройками. При желании можно изменить настройки просмотра в
                индивидуальном порядке.
              </li>
            </ul>

            <ul className="support_content-item">
              <h5>При выборе опции «Всем»:</h5>

              <ul className="support_content-text">
                <h6>Все спортсмены на G-fit</h6>
                <li>
                  Будут иметь полный доступ к данной странице. Фотографии
                  активности и информация о снаряжении будут видны
                  неподписчикам, если настройки профиля — «Всем». Установив
                  опцию «Подписчикам», можно скрыть фотографии и информацию о
                  снаряжении от пользователей, не подписанных на вас.
                </li>

                <li>
                  Активность появится в турнирной таблице участков и задач. Из
                  турнирных таблиц другие пользователи могут перейти на ваши
                  страницы с данными тренировок и профиля.
                </li>

                <h6>Все пользователи сети:</h6>
                <li>
                  Увидят версию страницы с данными тренировок для
                  зарегистрированных пользователей, включая дистанцию, набор
                  высоты, время в движении, темп/скорость, калории,
                  относительное усилие, фотографии (кроме профилей с настройкой
                  «Подписчикам»), карты, профиль набора высоты, лучшие
                  достижения, промежуточное время, совпадения популярных
                  участков, затраченное время, зачеты и комментарии.
                </li>
              </ul>

              <h5>При выборе опции «Подписчикам»:</h5>
              <ul className="support_content-text">
                <h6>Подписчики:</h6>
                <li>
                  Смогут иметь доступ к данной странице, включая время начала
                  тренировки, фото и снаряжение.
                </li>

                <li>
                  Активность не будет общедоступна в турнирных таблицах участков
                  и задач. Спортсмен и его подписчики смогут видеть совпадения
                  участков и их время на странице с данными тренировок.
                </li>

                <h6>Не подписчики</h6>
                <li>
                  Не смогут получить доступ к странице, но могут видеть обзор
                  активности в профиле спортсмена или в ленте клуба. При желании
                  скрыть обзоры тренировок из своего профиля или ленты клуба
                  следует изменить настройки доступа профиля, выбрав
                  «Подписчикам».
                </li>

                <li>
                  Смогут видеть совместные тренировки с другими спортсменами,
                  однако не будут иметь доступ к странице с данными. Во
                  избежание этого необходимо изменить настройки доступа
                  групповых тренировок.
                </li>

                <h6>Никто в сети</h6>
                <li>
                  Не увидит версию тренировки для зарегистрированных
                  пользователей. Если пользователь, не зашедший в аккаунт,
                  попытается открыть тренировку с настройкой «Подписчикам», то
                  он будет перенаправлен на страницу входа/создания аккаунта.
                </li>
              </ul>

              <h5>При выборе опции «Только вам»</h5>

              <ul className="support_content-text">
                <li>
                  Вы единственный пользователь, который может просматривать
                  страницу с данными тренировок.
                </li>

                <li>
                  Активность не появится в профиле или ленте клуба в виде
                  обзора, а также не будет видна в общедоступных турнирных
                  таблицах.
                </li>

                <li>
                  При участии в задаче другие спортсмены смогут видеть
                  обновления в полосе прогресса на странице профиля в мобильном
                  приложении.
                </li>

                <li>
                  Вы можете видеть совпадения участков и их время на странице
                  данных активности.
                </li>
              </ul>
            </ul>

            <div className="support_info">
              <h4>Была ли эта статья полезной?</h4>
              <p>Пользователи, считающие этот материал полезным: 82 из 137</p>
            </div>

            <div className="support_comment">
              <h2>Комментарии</h2>
              <p>0 комментариев</p>

              <div>Статья закрыта для комментариев.</div>
            </div>

            <div className="support_similar">
              <h2>Похожие статьи</h2>
              <ul className="support_similar-box">
                <li>
                  <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
                    Настройки конфиденциальности для страницы профиля
                  </a>
                </li>
                <li>
                  <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
                    Редактирование предыдущих тренировок
                  </a>
                </li>
                <li>
                  <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
                    Информация и настройки доступа
                  </a>
                </li>
                <li>
                  <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
                    Как G-fit использует данные показателей здоровья
                  </a>
                </li>
                <li>
                  <a href="app/src/pages/Documentation/documentPage/DocumentPage#">
                    Polar и G-fit
                  </a>
                </li>
              </ul>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
}

export default DocumentPage;
